{
  "backend/main.mo": "Motoko canister handling user profiles and contact submissions with access control and admin‑restricted retrieval.",
  "feature_evidence.json": "Feature evidence report mapping two header‑related features to affected files and components.",
  "frontend-file-summaries.txt": "Text file containing short descriptions of all frontend files and their roles.",
  "frontend/index.css": "Tailwind base and theme variables defining color tokens and dark‑mode styles.",
  "frontend/index.html": "HTML entry point setting the site slug and loading the React app.",
  "frontend/src/App.tsx": "App component that mounts the landing page and performs hash‑based auto‑scroll.",
  "frontend/src/components/ContactForm.tsx": "Validated contact form component submitting contact data via React Query.",
  "frontend/src/components/sections/AboutSection.tsx": "About section highlighting service features with icons.",
  "frontend/src/components/sections/AdvisorSection.tsx": "Advisor profile section with portrait, title, and description.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact section combining contact info cards and the contact form.",
  "frontend/src/components/sections/CoverageSection.tsx": "Displays a grid of coverage items with icons and descriptions inside a styled section.",
  "frontend/src/components/sections/FaqSection.tsx": "Renders an accordion of FAQs with questions and answers in a styled section.",
  "frontend/src/components/sections/FooterSection.tsx": "Shows footer info including branding, contact details, copyright, and a caffeine.ai link.",
  "frontend/src/components/sections/HeaderTopBar.tsx": "Provides a sticky top bar with branding, advisor info, and a call button.",
  "frontend/src/components/sections/HeroSection.tsx": "Creates a hero banner with headline, description, call/WhatsApp buttons, and an illustration.",
  "frontend/src/components/sections/PlanOptionsSection.tsx": "Displays health insurance plan options in cards with icons and titles.",
  "frontend/src/components/sections/TataAigSection.tsx": "Presents TATA AIG plan overview with benefits listed inside a card.",
  "frontend/src/components/sections/WhyChooseUsSection.tsx": "Shows reasons to choose the service using icon-feature cards in a gradient section.",
  "frontend/src/components/SecureHealthKeralaLandingPage.tsx": "Composes all landing page sections including header, content sections, and footer.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, auto-refreshing dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and state tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines a mutation hook to submit contact data via the actor and invalidate related queries.",
  "frontend/src/index.css": "Contains Tailwind base styles and CSS variables defining brand colors, themes, and utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentity providers.",
  "frontend/src/utils/siteSlug.ts": "Defines a fixed site slug and provides validation and retrieval helpers with a fallback slug.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read, store, retrieve, and clear URL and session-based parameters, supporting hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, and plugins including typography, container queries, and animations.",
  "project_state.json": "Stores the current project state, requirements, branding details, and known issues for the Secure Health Kerala site."
}