{
  "backend/main.mo": "Main actor defines siteDomain, user profile and contact management with access control and admin-only retrieval functions.",
  "backend/migration.mo": "Migration module adds the new siteDomain field while preserving existing state during upgrades.",
  "feature_evidence.json": "Feature evidence report documenting the custom site slug change to AryaTatainsurance and related frontend files.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend components, styles, and utilities in the project.",
  "frontend/index.css": "Tailwind base layer defining color tokens, dark mode values, and shared global styles.",
  "frontend/index.html": "Entry HTML file setting the site slug meta tag to AryaTatainsurance and loading the app bundle.",
  "frontend/src/App.tsx": "App component that enables hash-based auto-scroll to the Advisor section and renders the landing page.",
  "frontend/src/components/ContactForm.tsx": "Validated contact form component handling field input, error messages, and backend submission with success state.",
  "frontend/src/components/sections/AboutSection.tsx": "About section presenting service description and four feature cards.",
  "frontend/src/components/sections/AdvisorSection.tsx": "Advisor section with anchor id, portrait, and advisor details for scroll targeting.",
  "frontend/src/components/sections/ContactSection.tsx": "Renders a contact section with phone, WhatsApp, location info, and an embedded ContactForm.",
  "frontend/src/components/sections/CoverageSection.tsx": "Displays a grid of health insurance coverage items with icons.",
  "frontend/src/components/sections/FaqSection.tsx": "Shows an accordion-style FAQ list with questions and expandable answers.",
  "frontend/src/components/sections/FooterSection.tsx": "Provides site footer with branding, contact details, copyright, and a caffeine.ai credit link.",
  "frontend/src/components/sections/HeaderTopBar.tsx": "Renders a sticky top bar with logo, advisor info, and a click-to-call button.",
  "frontend/src/components/sections/HeroSection.tsx": "Displays the hero banner with headline, call-to-action buttons, and hero illustration.",
  "frontend/src/components/sections/PlanOptionsSection.tsx": "Shows available insurance plan types in a grid of icon cards.",
  "frontend/src/components/sections/TataAigSection.tsx": "Presents TATA AIG insurance benefits in a styled card layout.",
  "frontend/src/components/sections/WhyChooseUsSection.tsx": "Lists key reasons to choose the service using icon-feature cards.",
  "frontend/src/components/SecureHealthKeralaLandingPage.tsx": "Composes all landing page sections including Advisor, FAQ, and Contact in order.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, state, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Provides a React Query mutation hook that submits a contact via an actor and invalidates the contacts query on success.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom color variables, dark mode settings, typography, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/utils/siteSlug.ts": "Offers utilities to validate and retrieve a predefined site slug with fallback handling.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and persisting URL parameters, including session storage support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radius, animations, plugins, and theme extensions.",
  "project_state.json": "Stores project metadata, requirements, features, and branding notes for the Secure Health Kerala website."
}