{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Secure Health Kerala — Reset sticky header emblem to uploaded image",
  "requirements": [
    {
      "id": "REQ-11",
      "summary": "Update the sticky header emblem to use the newly uploaded emblem image while keeping advisor text and call CTA unchanged.",
      "acceptanceCriteria": [
        "Header emblem graphic in the sticky top bar is updated to the new uploaded emblem artwork (not the previous /assets/generated/tata-aig-logo.dim_512x512.png).",
        "Advisor text remains visible and unchanged: \"Arya Vineeth\" and \"TATA AIG Advisor\".",
        "The call CTA remains unchanged and continues to use tel:9495670101.",
        "The emblem displays cleanly (no distortion), preserves aspect ratio, and fits within the existing header height on mobile and desktop."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/HeaderTopBar.tsx",
          "operation": "modify",
          "description": "Replace the current emblem src (\"/assets/generated/tata-aig-logo.dim_512x512.png\") with the new static asset path \"/assets/header-emblem-reset.dim_512x512.png\"; keep advisor text and tel:9495670101 unchanged; adjust image classes to ensure aspect ratio is preserved (e.g., keep w-auto and add object-contain) so it fits cleanly within the existing header height across breakpoints."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Add a web-optimized emblem static asset under frontend/public/assets and reference it from the header with accurate English alt text.",
      "acceptanceCriteria": [
        "An optimized emblem asset is available under frontend/public/assets/ (e.g., PNG) derived from download-1.jpg.",
        "HeaderTopBar references the new static asset path under /assets/ rather than pointing to the old generated logo path.",
        "Image alt text is English and accurately describes the emblem."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/header-emblem-reset.dim_512x512.png",
          "operation": "create",
          "description": "Create an optimized PNG emblem asset derived from the uploaded download-1.jpg at frontend/public/assets/header-emblem-reset.dim_512x512.png (sized/cropped for clean header display and web delivery)."
        },
        {
          "path": "frontend/src/components/sections/HeaderTopBar.tsx",
          "operation": "modify",
          "description": "Update the <img> alt text to an accurate English description of the emblem (e.g., \"TATA AIG emblem\") and ensure the referenced src points to /assets/header-emblem-reset.dim_512x512.png (not the old generated logo)."
        }
      ]
    }
  ]
}